In [1]:
from pathlib import Path
import os
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
data_folder = Path("../../data")
os.listdir(data_folder)

['00.ghichu.txt',
 '00_dhcntt-dtdh_19-01-2016_scan.pdf',
 '01.sinhvien.xlsx',
 '02.diem.xlsx',
 '03.sinhvien_chungchi.xlsx',
 '04.xeploaiav.xlsx',
 '05.ThiSinh.xlsx',
 '06.giayxacnhan.xlsx',
 '08.XLHV.xlsx',
 '10.diemrl.xlsx',
 '12.baoluu.xlsx',
 '14.totnghiep.xlsx',
 'diemrl.xlsx',
 'diem_Thu.xlsx',
 'Education_dataset_V2.rar',
 'sinhvien_dtb_hocky.xlsx',
 'sinhvien_dtb_toankhoa.xlsx',
 'uit_hocphi_miengiam.xlsx']

In [3]:
data_stem = 'sinhvien_dtb_hocky'
old_df = pd.read_excel(data_folder/f"{data_stem}.xlsx")
new_df = old_df.copy(deep = True)

In [4]:
new_df.sample(3)

                                           mssv  hocky  namhoc  dtbhk  sotchk
58055  38912BD1XPvAibaEXe+zZoiw8Jl74MJpKKv5Zqd8      2    2020   8.54      20
426    0B2AAC0EXPvAibaEXe9CJmVsz9P34qS8MDP5qhfn      1    2017   5.76      24
14344  B1316403XPvAibaEXe9/83vYrk4yZojqJCz43d9S      1    2016   8.33      24

In [5]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 84952 entries, 0 to 84951
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   mssv    84952 non-null  object
 1   hocky   84952 non-null  int64
 2   namhoc  84952 non-null  int64
 3   dtbhk   84952 non-null  float64
 4   sotchk  84952 non-null  int64
dtypes: float64(1), int64(3), object(1)
memory usage: 3.2+ MB

In [6]:
old_primary_key = ['mssv', 'namhoc', 'hocky']
new_primary_key = ['mssv', 'nam_hoc', 'hoc_ky']

In [7]:
old_df.columns

Index(['mssv', 'hocky', 'namhoc', 'dtbhk', 'sotchk'], dtype='object')

In [8]:
new_df.columns = ['mssv', 'hoc_ky', 'nam_hoc', 'dtb_hk', 'so_tc_hk']

In [9]:
new_df.describe()

            hoc_ky       nam_hoc        dtb_hk      so_tc_hk
count  84952.00000  84952.000000  84952.000000  84952.000000
mean       1.52605   2018.440861      6.714582     16.703350
std        0.60096      2.466169      2.049809      6.305202
min        1.00000   2013.000000      0.000000      0.000000
25%        1.00000   2017.000000      6.070000     14.000000
50%        1.00000   2019.000000      7.250000     18.000000
75%        2.00000   2021.000000      8.070000     20.000000
max        3.00000   2022.000000     10.000000    195.000000

In [10]:
for col in new_primary_key:
    print(new_df[new_df[col].isnull()])

Empty DataFrame
Columns: [mssv, hoc_ky, nam_hoc, dtb_hk, so_tc_hk]
Index: []
Empty DataFrame
Columns: [mssv, hoc_ky, nam_hoc, dtb_hk, so_tc_hk]
Index: []
Empty DataFrame
Columns: [mssv, hoc_ky, nam_hoc, dtb_hk, so_tc_hk]
Index: []

In [11]:
new_df.duplicated().sum()

0

In [12]:
new_df.duplicated(subset=new_primary_key).sum()

0

# mssv

In [13]:
new_df.columns

Index(['mssv', 'hoc_ky', 'nam_hoc', 'dtb_hk', 'so_tc_hk'], dtype='object')

In [14]:
new_df.mssv.dtype

dtype('O')

In [15]:
new_df.mssv.value_counts(dropna=False)

mssv
9A84BBE7XPvAibaEXe8ydgsBCmjqA6hvcbpa5SDa    22
5EA0E379XPvAibaEXe9Xnw4t0GPgx3ZLzmzrJTA6    22
0A275EF0XPvAibaEXe9j81k8MH0oJ07F7M1SwTm7    21
54166400XPvAibaEXe+5f3nhbX2ehx/EY+0e6tvl    21
0BAF3540XPvAibaEXe9HXpb1PepyFQeHHIpoFKlX    21
                                            ..
D465EC68XPvAibaEXe+8+5uQAPsgDTDOp8CQLmB3     1
2CA61C50XPvAibaEXe+8+5uQAPsgDX1yNlqcm/n4     1
774F6000XPvAibaEXe+8+5uQAPsgDc5HtE2tMaaA     1
74E2FEBFXPvAibaEXe+8+5uQAPsgDd+wL3MN4wg0     1
23418DFBXPvAibaEXe8fkFoA0ROB11ZORpcgaZsN     1
Name: count, Length: 13608, dtype: int64

In [16]:
new_df.mssv.isnull().sum()

0

In [17]:
new_df.mssv = new_df.mssv.str.strip()

In [18]:
new_df.mssv.str.len().value_counts(dropna=False)

mssv
40    84952
Name: count, dtype: int64

# hoc_ky

In [19]:
new_df.columns

Index(['mssv', 'hoc_ky', 'nam_hoc', 'dtb_hk', 'so_tc_hk'], dtype='object')

In [20]:
new_df.hoc_ky.dtype

dtype('int64')

In [21]:
new_df.hoc_ky.value_counts(dropna=False)

hoc_ky
1    45013
2    35189
3     4750
Name: count, dtype: int64

In [22]:
new_df.hoc_ky.isnull().sum()

0

# nam_hoc

In [23]:
new_df.columns

Index(['mssv', 'hoc_ky', 'nam_hoc', 'dtb_hk', 'so_tc_hk'], dtype='object')

In [24]:
new_df.nam_hoc.dtype

dtype('int64')

In [25]:
new_df.nam_hoc.value_counts(dropna=False)

nam_hoc
2021    13851
2020    12414
2019    10957
2018    10129
2017     9002
2016     7964
2022     7955
2015     6194
2014     4236
2013     2250
Name: count, dtype: int64

In [26]:
new_df.nam_hoc.isnull().sum()

0

# dtb_hk

In [27]:
new_df.columns

Index(['mssv', 'hoc_ky', 'nam_hoc', 'dtb_hk', 'so_tc_hk'], dtype='object')

In [28]:
new_df.dtb_hk.dtype

dtype('float64')

In [29]:
new_df.dtb_hk.value_counts(dropna=False)

dtb_hk
0.00    2261
8.00     527
8.50     461
7.50     409
8.30     408
        ...
0.01       1
9.93       1
9.91       1
9.95       1
9.76       1
Name: count, Length: 991, dtype: int64

In [30]:
new_df.dtb_hk.isnull().sum()

0

In [31]:
new_df.dtb_hk.describe()

count    84952.000000
mean         6.714582
std          2.049809
min          0.000000
25%          6.070000
50%          7.250000
75%          8.070000
max         10.000000
Name: dtb_hk, dtype: float64

# so_tc_hk

In [32]:
new_df.columns

Index(['mssv', 'hoc_ky', 'nam_hoc', 'dtb_hk', 'so_tc_hk'], dtype='object')

In [33]:
new_df.so_tc_hk.dtype

dtype('int64')

In [34]:
new_df.so_tc_hk.value_counts(dropna=False)

so_tc_hk
19     8171
17     7865
20     7642
18     7102
16     6984
21     6095
22     5531
15     5070
14     4053
23     3754
24     3191
13     2617
10     2389
4      2351
12     1879
3      1548
8      1500
7      1421
11     1114
0       967
6       847
25      705
9       588
26      489
2       297
27      244
5       184
28      169
29       94
30       51
192      20
138      11
1         5
32        1
44        1
195       1
69        1
Name: count, dtype: int64

In [35]:
new_df.so_tc_hk.isnull().sum()

0

In [36]:
new_df.so_tc_hk.describe()

count    84952.000000
mean        16.703350
std          6.305202
min          0.000000
25%         14.000000
50%         18.000000
75%         20.000000
max        195.000000
Name: so_tc_hk, dtype: float64

# data type

In [37]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 84952 entries, 0 to 84951
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   mssv      84952 non-null  object
 1   hoc_ky    84952 non-null  int64
 2   nam_hoc   84952 non-null  int64
 3   dtb_hk    84952 non-null  float64
 4   so_tc_hk  84952 non-null  int64
dtypes: float64(1), int64(3), object(1)
memory usage: 3.2+ MB

In [38]:
tmp = new_df.hoc_ky.unique().tolist()
mapping_dict = {a:str(a) for a in tmp}
new_df.hoc_ky = new_df.hoc_ky.map(mapping_dict)
mapping_dict

{1: '1', 2: '2', 3: '3'}

In [39]:
tmp = new_df.nam_hoc.unique().tolist()
mapping_dict = {a:str(a) for a in tmp}
new_df.nam_hoc = new_df.nam_hoc.map(mapping_dict)
mapping_dict

{2016: '2016',
 2017: '2017',
 2018: '2018',
 2015: '2015',
 2014: '2014',
 2019: '2019',
 2020: '2020',
 2013: '2013',
 2021: '2021',
 2022: '2022'}

In [40]:
tmp = new_df.so_tc_hk.unique().tolist()
mapping_dict = {a:str(a) for a in tmp}
new_df.so_tc_hk = new_df.so_tc_hk.map(mapping_dict)
mapping_dict

{13: '13',
 17: '17',
 16: '16',
 23: '23',
 21: '21',
 12: '12',
 6: '6',
 20: '20',
 15: '15',
 8: '8',
 19: '19',
 18: '18',
 24: '24',
 22: '22',
 4: '4',
 7: '7',
 0: '0',
 11: '11',
 14: '14',
 3: '3',
 10: '10',
 5: '5',
 27: '27',
 25: '25',
 28: '28',
 26: '26',
 9: '9',
 2: '2',
 29: '29',
 30: '30',
 32: '32',
 44: '44',
 1: '1',
 138: '138',
 195: '195',
 69: '69',
 192: '192'}

In [41]:
new_df.mssv = new_df.mssv.astype('category')
new_df.hoc_ky = new_df.hoc_ky.astype('category')
new_df.nam_hoc = new_df.nam_hoc.astype('category')
new_df.dtb_hk = new_df.dtb_hk.astype('float32')
new_df.so_tc_hk = new_df.so_tc_hk.astype('category')
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 84952 entries, 0 to 84951
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   mssv      84952 non-null  category
 1   hoc_ky    84952 non-null  category
 2   nam_hoc   84952 non-null  category
 3   dtb_hk    84952 non-null  float32
 4   so_tc_hk  84952 non-null  category
dtypes: category(4), float32(1)
memory usage: 1.3 MB

# final check

In [42]:
new_df[new_df.isnull().any(axis=1)]

Empty DataFrame
Columns: [mssv, hoc_ky, nam_hoc, dtb_hk, so_tc_hk]
Index: []

In [43]:
new_df.duplicated().sum()

0

In [44]:
new_df[new_primary_key].duplicated().sum()

0

In [45]:
new_df.describe()

             dtb_hk
count  84952.000000
mean       6.714581
std        2.049809
min        0.000000
25%        6.070000
50%        7.250000
75%        8.070000
max       10.000000

In [46]:
new_df.columns

Index(['mssv', 'hoc_ky', 'nam_hoc', 'dtb_hk', 'so_tc_hk'], dtype='object')

In [47]:
new_df.mssv.value_counts(dropna=False)

mssv
5EA0E379XPvAibaEXe9Xnw4t0GPgx3ZLzmzrJTA6    22
9A84BBE7XPvAibaEXe8ydgsBCmjqA6hvcbpa5SDa    22
54166400XPvAibaEXe+5f3nhbX2ehx/EY+0e6tvl    21
0BAF3540XPvAibaEXe9HXpb1PepyFQeHHIpoFKlX    21
84F1726EXPvAibaEXe/FejQN8/S5fHF/hPdc4T81    21
                                            ..
8DFCFCD7XPvAibaEXe94h5DSR+AH+/1MIWnl2SCP     1
8E233CAAXPvAibaEXe//XeFNwgvXgjTq2OmCM5Xg     1
BEE29266XPvAibaEXe+sfYgLIH7gO26xJqZJX9CM     1
46C5DD4CXPvAibaEXe/HavVGti21aAqcOquxnwOi     1
3AAC7BD2XPvAibaEXe8Ei6irkiwEYPxy7I+Mki3/     1
Name: count, Length: 13608, dtype: int64

In [48]:
new_df.hoc_ky.value_counts(dropna=False)

hoc_ky
1    45013
2    35189
3     4750
Name: count, dtype: int64

In [49]:
new_df.nam_hoc.value_counts(dropna=False)

nam_hoc
2021    13851
2020    12414
2019    10957
2018    10129
2017     9002
2016     7964
2022     7955
2015     6194
2014     4236
2013     2250
Name: count, dtype: int64

In [50]:
new_df.dtb_hk.value_counts(dropna=False)

dtb_hk
0.00    2261
8.00     527
8.50     461
7.50     409
8.30     408
        ...
0.01       1
9.93       1
9.91       1
9.95       1
9.76       1
Name: count, Length: 991, dtype: int64

In [51]:
new_df.so_tc_hk.value_counts(dropna=False)

so_tc_hk
19     8171
17     7865
20     7642
18     7102
16     6984
21     6095
22     5531
15     5070
14     4053
23     3754
24     3191
13     2617
10     2389
4      2351
12     1879
3      1548
8      1500
7      1421
11     1114
0       967
6       847
25      705
9       588
26      489
2       297
27      244
5       184
28      169
29       94
30       51
192      20
138      11
1         5
69        1
44        1
195       1
32        1
Name: count, dtype: int64

# save

In [52]:
clean_data_folder = Path("../clean_data")
new_df.to_parquet(clean_data_folder/f"{data_stem}.parquet", index=False)
haha_df = pd.read_parquet(clean_data_folder/f"{data_stem}.parquet")

In [53]:
old_df[old_df.isnull().any(axis=1)]

Empty DataFrame
Columns: [mssv, hocky, namhoc, dtbhk, sotchk]
Index: []

In [54]:
haha_df[haha_df.isnull().any(axis=1)]

Empty DataFrame
Columns: [mssv, hoc_ky, nam_hoc, dtb_hk, so_tc_hk]
Index: []

In [55]:
old_df[old_primary_key].duplicated().sum()

0

In [56]:
haha_df[new_primary_key].duplicated().sum()

0

In [57]:
old_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 84952 entries, 0 to 84951
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   mssv    84952 non-null  object
 1   hocky   84952 non-null  int64
 2   namhoc  84952 non-null  int64
 3   dtbhk   84952 non-null  float64
 4   sotchk  84952 non-null  int64
dtypes: float64(1), int64(3), object(1)
memory usage: 3.2+ MB

In [58]:
haha_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 84952 entries, 0 to 84951
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   mssv      84952 non-null  category
 1   hoc_ky    84952 non-null  category
 2   nam_hoc   84952 non-null  category
 3   dtb_hk    84952 non-null  float32
 4   so_tc_hk  84952 non-null  category
dtypes: category(4), float32(1)
memory usage: 1.3 MB

In [59]:
old_df.describe()

             hocky        namhoc         dtbhk        sotchk
count  84952.00000  84952.000000  84952.000000  84952.000000
mean       1.52605   2018.440861      6.714582     16.703350
std        0.60096      2.466169      2.049809      6.305202
min        1.00000   2013.000000      0.000000      0.000000
25%        1.00000   2017.000000      6.070000     14.000000
50%        1.00000   2019.000000      7.250000     18.000000
75%        2.00000   2021.000000      8.070000     20.000000
max        3.00000   2022.000000     10.000000    195.000000

In [60]:
haha_df.describe()

             dtb_hk
count  84952.000000
mean       6.714581
std        2.049809
min        0.000000
25%        6.070000
50%        7.250000
75%        8.070000
max       10.000000

In [61]:
old_df.sample(5)

                                           mssv  hocky  namhoc  dtbhk  sotchk
64159  9A252138XPvAibaEXe+23cTkF8qTDwOXkV65zBwE      2    2020   5.21       7
53100  52E66659XPvAibaEXe/7sxkigC7f5zukR2WlNRO3      1    2017   7.22      24
5075   962B588DXPvAibaEXe8808q51BnmQv7uo+CT+yEW      2    2017   7.27      21
47580  E8F3AB36XPvAibaEXe+oAybUv81bbh8cI4AooEYz      1    2020   9.20      10
19504  15A03C0DXPvAibaEXe/69hWWh+JD2UVz3ufk0Hxi      1    2016   5.91      14

In [62]:
haha_df.sample(10)

,mssv,hoc_ky,nam_hoc,dtb_hk,so_tc_hk
6059,E8E4ADB2XPvAibaEXe/AdnwkoyhfDsgpoaEF+gFF,1,2017,6.84,20
39437,D1CF0680XPvAibaEXe8y6/RMXZRwBRNEtSk1fgWN,1,2019,5.70,12
17632,E7748004XPvAibaEXe/btl79MArZLOOaYoVFdLPX,2,2016,5.96,19
61237,788BA2EEXPvAibaEXe80lJLbnvW/+xPSvVDEvJUz,1,2021,8.12,23
8021,F98B5B14XPvAibaEXe9+3TdUbRXdLeKIcSwrVH9U,3,2017,5.40,4
54859,3899D7EDXPvAibaEXe9eSUilQ3V71guQIuvMMION,2,2013,0.94,17
450,10BC2077XPvAibaEXe+JF4o+SEKcGNvyuiGTmxfU,3,2017,4.00,4
80914,4674A752XPvAibaEXe/8X6gsb95YiNVI+GsvE5uC,2,2021,8.28,12
69518,A16B06D2XPvAibaEXe+nFvcMo/cK5N+/HfSULxjN,1,2021,6.89,18
24864,EF6D3E34XPvAibaEXe9o3csoNuwUvO7brxBe1EBb,1,2017,4.36,20

In [63]:
os.listdir(clean_data_folder)

['12.baoluu.parquet',
 '14.totnghiep.parquet',
 'desktop.ini',
 'diemrl.parquet',
 'diem_Thu.parquet',
 'sinhvien_dtb_hocky.parquet',
 'uit_hocphi_miengiam.parquet']